; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v1 - type_1 ?v5 - type_2)
 	      (pred_3 ?v3 - object ?v5 - type_2)
	      (pred_1 ?v1 - type_1 ?v6 - type_3)
	      (pred_4 ?v1 - type_1 ?v3 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v1 - type_1 ?v8 ?v2 - type_2)
       :precondition (and  (pred_2 ?v1 ?v8))
       :effect (and  (pred_2 ?v1 ?v2)
		     (not (pred_2 ?v1 ?v8))))

   (:action op_3
       :parameters (?v1 - type_1 ?v4 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v7) (pred_2 ?v1 ?v7) (pred_1 ?v1 ?v6))
       :effect (and (pred_4 ?v1 ?v4 ?v6)
		    (not (pred_3 ?v4 ?v7)) 
		    (not (pred_1 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_1 ?v4 - object ?v7 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v4 ?v6) (pred_2 ?v1 ?v7))
       :effect (and (pred_3 ?v4 ?v7)
		    (pred_1 ?v1 ?v6)
		    (not (pred_4 ?v1 ?v4 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_08 - type_1
obj_09 obj_10 obj_11 obj_05 - type_3
obj_03 obj_04 obj_12 - type_2
obj_06 obj_07 obj_01 - object)
(:init
(pred_2 obj_02 obj_12)
(pred_1 obj_02 obj_09)
(pred_1 obj_02 obj_10)
(pred_2 obj_08 obj_12)
(pred_1 obj_08 obj_11)
(pred_1 obj_08 obj_05)
(pred_3 obj_06 obj_03)
(pred_3 obj_07 obj_12)
(pred_3 obj_01 obj_04)
)
(:goal
(and
(pred_3 obj_06 obj_03)
(pred_3 obj_07 obj_04)
(pred_3 obj_01 obj_12)
)
)

(:constraints
  (always (not (pred_2 obj_02 obj_04)))
)
)

; plan
1. (op_3 obj_02 obj_07 obj_12 obj_10)
   deleted: (pred_3 obj_07 obj_12) (pred_1 obj_02 obj_10)
   added: (pred_4 obj_02 obj_07 obj_10)
   goals met: 1 of 3
2. (op_1 obj_08 obj_12 obj_04)
   deleted: (pred_2 obj_08 obj_12)
   added: (pred_2 obj_08 obj_04)
   goals met: 1 of 3
3. (op_3 obj_08 obj_01 obj_04 obj_05)
   deleted: (pred_3 obj_01 obj_04) (pred_1 obj_08 obj_05)
   added: (pred_4 obj_08 obj_01 obj_05)
   goals met: 1 of 3
4. (op_1 obj_08 obj_04 obj_12)
   deleted: (pred_2 obj_08 obj_04)
   added: (pred_2 obj_08 obj_12)
   goals met: 1 of 3
5. (op_2 obj_08 obj_01 obj_12 obj_05)
   deleted: (pred_4 obj_08 obj_01 obj_05)
   added: (pred_3 obj_01 obj_12) (pred_1 obj_08 obj_05)
   goals met: 2 of 3
6. (op_2 obj_02 obj_07 obj_12 obj_10)
   deleted: (pred_4 obj_02 obj_07 obj_10)
   added: (pred_3 obj_07 obj_12) (pred_1 obj_02 obj_10)
   goals met: 2 of 3
7. (op_3 obj_08 obj_07 obj_12 obj_05)
   deleted: (pred_3 obj_07 obj_12) (pred_1 obj_08 obj_05)
   added: (pred_4 obj_08 obj_07 obj_05)
   goals met: 2 of 3
8. (op_1 obj_08 obj_12 obj_04)
   deleted: (pred_2 obj_08 obj_12)
   added: (pred_2 obj_08 obj_04)
   goals met: 2 of 3
9. (op_2 obj_08 obj_07 obj_04 obj_05)
   deleted: (pred_4 obj_08 obj_07 obj_05)
   added: (pred_3 obj_07 obj_04) (pred_1 obj_08 obj_05)
   goals met: 3 of 3
